# GetTreeControlTextSelectedItem

## Description
Retrieves the item text of the selected item from a tree control.

```pascal
FUNCTION GetTreeControlTextSelectedItem(
				nDialogID    : LONGINT;
				nComponentID : LONGINT;
				VAR itemText : STRING): BOOLEAN;
```

```python
def vs.GetTreeControlTextSelectedItem(nDialogID, nComponentID):
    return (BOOLEAN, itemText)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT|   |
|nComponentID|LONGINT|   |
|itemText|STRING|   |

## Version
Availability: from Vectorworks 2011

## Category
* Dialogs - Modern